betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_smartcard.c
  [..]
   (@) It is also possible to choose 0.5 stop bit for receiving but it is recommended
       to use 1.5 stop bits for both transmitting and receiving to avoid switching
       between the two configurations.
  [..]
    The DAL_SMARTCARD_Init() function follows the USART  SmartCard configuration
    procedures (details for the procedures are available in reference manual).

@endverbatim

  The SMARTCARD frame format is given in the following table:
       +-------------------------------------------------------------+
       |   M bit |  PCE bit  |        SMARTCARD frame                |
       |---------------------|---------------------------------------|
       |    1    |    1      |    | SB | 8 bit data | PB | STB |     |
       +-------------------------------------------------------------+
  * @{
  */

/**
  * @brief  Initializes the SmartCard mode according to the specified
  *         parameters in the SMARTCARD_InitTypeDef and create the associated handle.
  * @param  hsc    Pointer to a SMARTCARD_HandleTypeDef structure that contains
  *                the configuration information for SMARTCARD module.
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_SMARTCARD_Init(SMARTCARD_HandleTypeDef *hsc)
{
  /* Check the SMARTCARD handle allocation */
  if(hsc == NULL)
  {
    return DAL_ERROR;
  }

  /* Check the parameters */
  ASSERT_PARAM(IS_SMARTCARD_INSTANCE(hsc->Instance));
  ASSERT_PARAM(IS_SMARTCARD_NACK_STATE(hsc->Init.NACKState));

  if(hsc->gState == DAL_SMARTCARD_STATE_RESET)
  {
    /* Allocate lock resource and initialize it */
    hsc->Lock = DAL_UNLOCKED;

#if USE_DAL_SMARTCARD_REGISTER_CALLBACKS == 1
    SMARTCARD_InitCallbacksToDefault(hsc);

    if (hsc->MspInitCallback == NULL)
    {
      hsc->MspInitCallback = DAL_SMARTCARD_MspInit;
    }

    /* Init the low level hardware */
    hsc->MspInitCallback(hsc);
#else
    /* Init the low level hardware : GPIO, CLOCK */
    DAL_SMARTCARD_MspInit(hsc);
#endif /* USE_DAL_SMARTCARD_REGISTER_CALLBACKS */
  }

  hsc->gState = DAL_SMARTCARD_STATE_BUSY;

  /* Set the Prescaler */
  MODIFY_REG(hsc->Instance->GTPSC, USART_GTPSC_PSC, hsc->Init.Prescaler);

  /* Set the Guard Time */
  MODIFY_REG(hsc->Instance->GTPSC, USART_GTPSC_GRDT, ((hsc->Init.GuardTime)<<8U));

  /* Set the Smartcard Communication parameters */
  SMARTCARD_SetConfig(hsc);

  /* In SmartCard mode, the following bits must be kept cleared:
  - LINEN bit in the USART_CTRL2 register
  - HDSEL and IREN bits in the USART_CTRL3 register.*/
  CLEAR_BIT(hsc->Instance->CTRL2, USART_CTRL2_LINMEN);
  CLEAR_BIT(hsc->Instance->CTRL3, (USART_CTRL3_IREN | USART_CTRL3_HDEN));

  /* Enable the SMARTCARD Parity Error Interrupt */
  SET_BIT(hsc->Instance->CTRL1, USART_CTRL1_PEIEN);

  /* Enable the SMARTCARD Framing Error Interrupt */
  SET_BIT(hsc->Instance->CTRL3, USART_CTRL3_ERRIEN);

  /* Enable the Peripheral */
  __DAL_SMARTCARD_ENABLE(hsc);

  /* Configure the Smartcard NACK state */
  MODIFY_REG(hsc->Instance->CTRL3, USART_CTRL3_SCNACKEN, hsc->Init.NACKState);

  /* Enable the SC mode by setting the SCEN bit in the CTRL3 register */
  hsc->Instance->CTRL3 |= (USART_CTRL3_SCEN);

  /* Initialize the SMARTCARD state*/
  hsc->ErrorCode = DAL_SMARTCARD_ERROR_NONE;
  hsc->gState= DAL_SMARTCARD_STATE_READY;
  hsc->RxState= DAL_SMARTCARD_STATE_READY;

  return DAL_OK;
}

/**
  * @brief DeInitializes the USART SmartCard peripheral
  * @param  hsc    Pointer to a SMARTCARD_HandleTypeDef structure that contains
  *                the configuration information for SMARTCARD module.
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_SMARTCARD_DeInit(SMARTCARD_HandleTypeDef *hsc)
{
  /* Check the SMARTCARD handle allocation */
  if(hsc == NULL)
  {
    return DAL_ERROR;
  }

  /* Check the parameters */
  ASSERT_PARAM(IS_SMARTCARD_INSTANCE(hsc->Instance));

  hsc->gState = DAL_SMARTCARD_STATE_BUSY;

  /* Disable the Peripheral */
  __DAL_SMARTCARD_DISABLE(hsc);

  /* DeInit the low level hardware */
#if USE_DAL_SMARTCARD_REGISTER_CALLBACKS == 1
  if (hsc->MspDeInitCallback == NULL)
  {
    hsc->MspDeInitCallback = DAL_SMARTCARD_MspDeInit;
  }
  /* DeInit the low level hardware */
  hsc->MspDeInitCallback(hsc);
#else
  DAL_SMARTCARD_MspDeInit(hsc);
#endif /* USE_DAL_SMARTCARD_REGISTER_CALLBACKS */

  hsc->ErrorCode = DAL_SMARTCARD_ERROR_NONE;
  hsc->gState = DAL_SMARTCARD_STATE_RESET;
  hsc->RxState = DAL_SMARTCARD_STATE_RESET;

  /* Release Lock */
  __DAL_UNLOCK(hsc);

  return DAL_OK;
}

/**
  * @brief  SMARTCARD MSP Init
  * @param  hsc    Pointer to a SMARTCARD_HandleTypeDef structure that contains
  *                the configuration information for SMARTCARD module.
  * @retval None
  */
__weak void DAL_SMARTCARD_MspInit(SMARTCARD_HandleTypeDef *hsc)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hsc);

  /* NOTE : This function should not be modified, when the callback is needed,
            the DAL_SMARTCARD_MspInit can be implemented in the user file
   */
}

/**
  * @brief SMARTCARD MSP DeInit
  * @param  hsc    Pointer to a SMARTCARD_HandleTypeDef structure that contains
  *                the configuration information for SMARTCARD module.
  * @retval None
  */
__weak void DAL_SMARTCARD_MspDeInit(SMARTCARD_HandleTypeDef *hsc)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hsc);

  /* NOTE : This function should not be modified, when the callback is needed,
            the DAL_SMARTCARD_MspDeInit can be implemented in the user file
   */
}

#if (USE_DAL_SMARTCARD_REGISTER_CALLBACKS == 1)
/**
  * @brief  Register a User SMARTCARD Callback
  *         To be used instead of the weak predefined callback
  * @param  hsc smartcard handle
  * @param  CallbackID ID of the callback to be registered
  *         This parameter can be one of the following values:
  *           @arg @ref DAL_SMARTCARD_TX_COMPLETE_CB_ID Tx Complete Callback ID
  *           @arg @ref DAL_SMARTCARD_RX_COMPLETE_CB_ID Rx Complete Callback ID
  *           @arg @ref DAL_SMARTCARD_ERROR_CB_ID Error Callback ID
  *           @arg @ref DAL_SMARTCARD_ABORT_COMPLETE_CB_ID Abort Complete Callback ID
  *           @arg @ref DAL_SMARTCARD_ABORT_TRANSMIT_COMPLETE_CB_ID Abort Transmit Complete Callback ID
  *           @arg @ref DAL_SMARTCARD_ABORT_RECEIVE_COMPLETE_CB_ID Abort Receive Complete Callback ID
  *           @arg @ref DAL_SMARTCARD_MSPINIT_CB_ID MspInit Callback ID
  *           @arg @ref DAL_SMARTCARD_MSPDEINIT_CB_ID MspDeInit Callback ID
  * @param  pCallback pointer to the Callback function
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_SMARTCARD_RegisterCallback(SMARTCARD_HandleTypeDef *hsc, DAL_SMARTCARD_CallbackIDTypeDef CallbackID, pSMARTCARD_CallbackTypeDef pCallback)
{
  DAL_StatusTypeDef status = DAL_OK;

  if (pCallback == NULL)
  {
    /* Update the error code */
    hsc->ErrorCode |= DAL_SMARTCARD_ERROR_INVALID_CALLBACK;

    return DAL_ERROR;
  }
  /* Process locked */
  __DAL_LOCK(hsc);

  if (hsc->gState == DAL_SMARTCARD_STATE_READY)
  {
    switch (CallbackID)
    {

      case DAL_SMARTCARD_TX_COMPLETE_CB_ID :
        hsc->TxCpltCallback = pCallback;
        break;

