betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_smartcard.c
  /* Reset ErrorCode */
  hsc->ErrorCode = DAL_SMARTCARD_ERROR_NONE;

  /* Restore hsc->gState and hsc->RxState to Ready */
  hsc->gState  = DAL_SMARTCARD_STATE_READY;
  hsc->RxState = DAL_SMARTCARD_STATE_READY;

#if (USE_DAL_SMARTCARD_REGISTER_CALLBACKS == 1)
  /* Call registered Abort complete callback */
  hsc->AbortCpltCallback(hsc);
#else
  /* Call legacy weak Abort complete callback */
  DAL_SMARTCARD_AbortCpltCallback(hsc);
#endif /* USE_DAL_SMARTCARD_REGISTER_CALLBACK */
}

/**
  * @brief  DMA SMARTCARD Tx communication abort callback, when initiated by user by a call to
  *         DAL_SMARTCARD_AbortTransmit_IT API (Abort only Tx transfer)
  *         (This callback is executed at end of DMA Tx Abort procedure following user abort request,
  *         and leads to user Tx Abort Complete callback execution).
  * @param  hdma DMA handle.
  * @retval None
  */
static void SMARTCARD_DMATxOnlyAbortCallback(DMA_HandleTypeDef *hdma)
{
  SMARTCARD_HandleTypeDef* hsc = ( SMARTCARD_HandleTypeDef* )((DMA_HandleTypeDef* )hdma)->Parent;

  hsc->TxXferCount = 0x00U;

  /* Restore hsc->gState to Ready */
  hsc->gState = DAL_SMARTCARD_STATE_READY;

#if (USE_DAL_SMARTCARD_REGISTER_CALLBACKS == 1)
  /* Call registered Abort Transmit Complete Callback */
  hsc->AbortTransmitCpltCallback(hsc);
#else
  /* Call legacy weak Abort Transmit Complete Callback */
  DAL_SMARTCARD_AbortTransmitCpltCallback(hsc);
#endif /* USE_DAL_SMARTCARD_REGISTER_CALLBACK */
}

/**
  * @brief  DMA SMARTCARD Rx communication abort callback, when initiated by user by a call to
  *         DAL_SMARTCARD_AbortReceive_IT API (Abort only Rx transfer)
  *         (This callback is executed at end of DMA Rx Abort procedure following user abort request,
  *         and leads to user Rx Abort Complete callback execution).
  * @param  hdma DMA handle.
  * @retval None
  */
static void SMARTCARD_DMARxOnlyAbortCallback(DMA_HandleTypeDef *hdma)
{
  SMARTCARD_HandleTypeDef* hsc = ( SMARTCARD_HandleTypeDef* )((DMA_HandleTypeDef* )hdma)->Parent;

  hsc->RxXferCount = 0x00U;

  /* Restore hsc->RxState to Ready */
  hsc->RxState = DAL_SMARTCARD_STATE_READY;

#if (USE_DAL_SMARTCARD_REGISTER_CALLBACKS == 1)
  /* Call registered Abort Receive Complete Callback */
  hsc->AbortReceiveCpltCallback(hsc);
#else
  /* Call legacy weak Abort Receive Complete Callback */
  DAL_SMARTCARD_AbortReceiveCpltCallback(hsc);
#endif /* USE_DAL_SMARTCARD_REGISTER_CALLBACK */
}

/**
  * @brief Configure the SMARTCARD peripheral
  * @param  hsc    Pointer to a SMARTCARD_HandleTypeDef structure that contains
  *                the configuration information for SMARTCARD module.
  * @retval None
  */
static void SMARTCARD_SetConfig(SMARTCARD_HandleTypeDef *hsc)
{
  uint32_t tmpreg = 0x00U;
  uint32_t pclk;

  /* Check the parameters */
  ASSERT_PARAM(IS_SMARTCARD_INSTANCE(hsc->Instance));
  ASSERT_PARAM(IS_SMARTCARD_POLARITY(hsc->Init.CLKPolarity));
  ASSERT_PARAM(IS_SMARTCARD_PHASE(hsc->Init.CLKPhase));
  ASSERT_PARAM(IS_SMARTCARD_LASTBIT(hsc->Init.CLKLastBit));
  ASSERT_PARAM(IS_SMARTCARD_BAUDRATE(hsc->Init.BaudRate));
  ASSERT_PARAM(IS_SMARTCARD_WORD_LENGTH(hsc->Init.WordLength));
  ASSERT_PARAM(IS_SMARTCARD_STOPBITS(hsc->Init.StopBits));
  ASSERT_PARAM(IS_SMARTCARD_PARITY(hsc->Init.Parity));
  ASSERT_PARAM(IS_SMARTCARD_MODE(hsc->Init.Mode));
  ASSERT_PARAM(IS_SMARTCARD_NACK_STATE(hsc->Init.NACKState));

  /* The LBCL, CPOL and CPHA bits have to be selected when both the transmitter and the
     receiver are disabled (TE=RE=0) to ensure that the clock pulses function correctly. */
  CLEAR_BIT(hsc->Instance->CTRL1, (USART_CTRL1_TXEN | USART_CTRL1_RXEN));

  /*---------------------------- USART CTRL2 Configuration ---------------------*/
  tmpreg = hsc->Instance->CTRL2;
  /* Clear CLKEN, CPOL, CPHA and LBCPOEN bits */
  tmpreg &= (uint32_t)~((uint32_t)(USART_CTRL2_CPHA | USART_CTRL2_CPOL | USART_CTRL2_CLKEN | USART_CTRL2_LBCPOEN));
  /* Configure the SMARTCARD Clock, CPOL, CPHA and LastBit -----------------------*/
  /* Set CPOL bit according to hsc->Init.CLKPolarity value */
  /* Set CPHA bit according to hsc->Init.CLKPhase value */
  /* Set LBCL bit according to hsc->Init.CLKLastBit value */
  /* Set Stop Bits: Set STOP[13:12] bits according to hsc->Init.StopBits value */
  tmpreg |= (uint32_t)(USART_CTRL2_CLKEN | hsc->Init.CLKPolarity |
                      hsc->Init.CLKPhase| hsc->Init.CLKLastBit | hsc->Init.StopBits);
  /* Write to USART CTRL2 */
  WRITE_REG(hsc->Instance->CTRL2, (uint32_t)tmpreg);

  tmpreg = hsc->Instance->CTRL2;

  /* Clear STOP[13:12] bits */
  tmpreg &= (uint32_t)~((uint32_t)USART_CTRL2_STOPCFG);

  /* Set Stop Bits: Set STOP[13:12] bits according to hsc->Init.StopBits value */
  tmpreg |= (uint32_t)(hsc->Init.StopBits);

  /* Write to USART CTRL2 */
  WRITE_REG(hsc->Instance->CTRL2, (uint32_t)tmpreg);

  /*-------------------------- USART CTRL1 Configuration -----------------------*/
  tmpreg = hsc->Instance->CTRL1;

  /* Clear M, PCE, PS, TE and RE bits */
  tmpreg &= (uint32_t)~((uint32_t)(USART_CTRL1_DBLCFG | USART_CTRL1_PCEN | USART_CTRL1_PCFG | USART_CTRL1_TXEN | \
                                   USART_CTRL1_RXEN));

  /* Configure the SMARTCARD Word Length, Parity and mode:
     Set the M bits according to hsc->Init.WordLength value
     Set PCE and PS bits according to hsc->Init.Parity value
     Set TE and RE bits according to hsc->Init.Mode value */
  tmpreg |= (uint32_t)hsc->Init.WordLength | hsc->Init.Parity | hsc->Init.Mode;

  /* Write to USART CTRL1 */
  WRITE_REG(hsc->Instance->CTRL1, (uint32_t)tmpreg);

  /*-------------------------- USART CTRL3 Configuration -----------------------*/
  /* Clear CTSEN and RTSEN bits */
  CLEAR_BIT(hsc->Instance->CTRL3, (USART_CTRL3_RTSEN | USART_CTRL3_CTSEN));

  /*-------------------------- USART BR Configuration -----------------------*/
#if defined(USART6)
  if((hsc->Instance == USART1) || (hsc->Instance == USART6))
  {
    pclk = DAL_RCM_GetPCLK2Freq();
    hsc->Instance->BR = SMARTCARD_BR(pclk, hsc->Init.BaudRate);
  }
#else
  if(hsc->Instance == USART1)
  {
    pclk = DAL_RCM_GetPCLK2Freq();
    hsc->Instance->BR = SMARTCARD_BR(pclk, hsc->Init.BaudRate);
  }
#endif /* USART6 */
  else
  {
    pclk = DAL_RCM_GetPCLK1Freq();
    hsc->Instance->BR = SMARTCARD_BR(pclk, hsc->Init.BaudRate);
  }
}

/**
  * @}
  */

#endif /* DAL_SMARTCARD_MODULE_ENABLED */
/**
  * @}
  */

/**
  * @}
  */


